app/Http/Controllers/Api/UserController.php

select * from `users`
---
    public function index()
    {
        $users=$this->userRepo->all();